-- --------------------------------------------------------
-- 호스트:                          112.222.157.156
-- 서버 버전:                        8.4.10 - MySQL Community Server - GPL
-- 서버 OS:                        Linux
-- HeidiSQL 버전:                  12.17.0.7270
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

-- 테이블 meerkatgram-post.posts 구조 내보내기
DROP TABLE IF EXISTS `posts`;
CREATE TABLE IF NOT EXISTS `posts` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT,
  `content` varchar(200) NOT NULL,
  `created_at` datetime(6) NOT NULL,
  `deleted_at` datetime(6) DEFAULT NULL,
  `image` varchar(100) NOT NULL,
  `updated_at` datetime(6) NOT NULL,
  `user_id` bigint unsigned NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=30 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- 테이블 데이터 meerkatgram-post.posts:~19 rows (대략적) 내보내기
DELETE FROM `posts`;
INSERT INTO `posts` (`id`, `content`, `created_at`, `deleted_at`, `image`, `updated_at`, `user_id`) VALUES
  (1, '아니한다. 진흥하여야 있다. 의무교육은.', '2025-11-26 18:34:41.000000', '2026-05-17 14:11:12.000000', 'http://112.222.157.156:6601/meerkat/post/image/20260719_1cf7f8df-646a-4b74-ae27-03b6a9960c58.jpg', '2026-05-17 14:11:12.000000', 3),
  (3, '죄를 보호한다. 범하고 증거인멸의 도피 법률에 범죄에 형사피고인은.\n처벌받지 모성의 진다. 법률로써 노력하여야 있다. 전통문화의 계승·발전과 무상으로 거듭.', '2025-11-29 05:03:38.000000', NULL, 'http://112.222.157.156:6601/meerkat/post/image/20260719_59c1e826-df45-4542-83cf-422f5f66c822.jpg', '2025-11-29 10:51:44.000000', 3),
  (4, '수 헌법에 소추되지 아니한다. 정하는 예술가의 신문의 국민은.\n법률이 국가는 소추되지 법률이 자유를.\n해당하는 모성의 대하여 사생활의 필요한.', '2025-11-01 18:33:22.000000', NULL, 'http://112.222.157.156:6601/meerkat/post/image/20260719_e9c1963b-f9ce-49d4-9365-859caa938f32.jpg', '2025-11-29 10:51:44.000000', 3),
  (5, '일반적으로 때까지는 아니하는 민족문화의 민족문화의 창달에 장기 민족문화의.\n효력을 법률이 민족문화의 청구할 현행범인인 가진다. 침해받지 처벌받지 기능을 죄를.\n국내법과 가진다. 범', '2025-11-28 02:00:34.000000', NULL, 'http://112.222.157.156:6601/meerkat/post/image/20260719_eb4d8c3e-24f7-405c-91f5-350bea33bd8f.jpg', '2025-11-29 10:51:44.000000', 3),
  (6, '재외국민을 노력하여야 모성의 3년 죄를 장기 해당하는 정한다. 정하는 소추되지.', '2025-11-21 08:06:37.000000', NULL, 'http://112.222.157.156:6601/meerkat/post/image/20260719_de1356d5-e990-4ce4-979f-ff520e93ddcc.jpg', '2025-11-29 10:51:44.000000', 3),
  (7, '범하고 영장을 법률에 의하여 구성하지 필요한.\n아니하며, 정하는 보호할 이상의 염려가 수 있을 보호를 신문의.\n있을 사항은 보장하기 법률로써 무죄로 정한다. 바에 경우와 모든.\n필', '2025-11-20 16:00:29.000000', NULL, 'http://112.222.157.156:6601/meerkat/post/image/20260719_f8e9cd22-4308-47c8-b111-b77df9629089.png', '2025-11-29 10:51:44.000000', 3),
  (8, '무상으로 때에는 보장하기 보호를 예술가의 의하여 통신·방송의 형에 바에. 민족문화의 일반적으로 헌법에 또는 신체의 범죄에 형사피고인은 예술가의 창달에 거듭. 이상의 권리는 모든 국', '2025-11-15 21:31:20.000000', NULL, 'http://112.222.157.156:6601/meerkat/post/image/20260719_5b7d3616-f355-415f-9da7-134ee48c37a7.png', '2025-11-29 10:51:44.000000', 3),
  (9, '행위로 또는 평생교육을 창달에. 사생활의 일반적으로 범죄에 있을 범죄에 구성하지. 때에는 보장하기 재외국민을 또는.', '2025-11-10 16:33:49.000000', NULL, 'http://112.222.157.156:6601/meerkat/post/image/20260719_700b1017-b609-4bf8-b8d6-fec9fb9818d8.jpg', '2025-11-29 10:51:44.000000', 3),
  (10, '의무교육은 범하고 모든 또는 확정될 필요한. 보호할 필요한 체결·공포된 시설기준과 법률로써 때에는 정하는 장기 청구할. 처벌받지 시설기준과 헌법에 보장하기 죄를 권리는 아니하며, ', '2025-11-05 08:20:01.000000', '2025-11-29 15:58:38.000000', 'http://112.222.157.156:6601/meerkat/post/image/20260719_1cf7f8df-646a-4b74-ae27-03b6a9960c58.jpg', '2025-11-29 10:51:44.000000', 3),
  (11, '해당하는 때까지는 행위로 진다. 경우와 사후에.\n유죄의 보호한다. 대하여.\n소추되지 권리는 구성하지.\n확정될 청구할 동일한 형사피고인은 염려가.', '2025-11-01 15:22:15.000000', NULL, 'http://112.222.157.156:6601/meerkat/post/image/20260719_59c1e826-df45-4542-83cf-422f5f66c822.jpg', '2025-11-29 10:51:44.000000', 4),
  (12, '통신·방송의 구성하지 평생교육을 국가는 보호한다.. 유죄의 보호할 법률로. 형사피고인은 진다. 창달에 보호할 사생활의 승인된 조약과 권리는. 도피 효력을 이상의 같은 있을 장기. ', '2025-11-19 23:00:03.000000', NULL, 'http://112.222.157.156:6601/meerkat/post/image/20260719_eb4d8c3e-24f7-405c-91f5-350bea33bd8f.jpg', '2025-11-29 10:51:44.000000', 4),
  (13, '한다. 국민은 의하여 보호할 또는 승인된 동일한 국가는. 장기 국민은 보호할 모성의 진흥하여야 의하여 거듭 확정될 기능을 국제법규는. 범죄에 형에 범하고 때까지는 보호를 사후에 조', '2025-11-09 14:29:21.000000', NULL, 'http://112.222.157.156:6601/meerkat/post/image/20260719_de1356d5-e990-4ce4-979f-ff520e93ddcc.jpg', '2025-11-29 10:51:44.000000', 4),
  (14, '시설기준과 의하여 판결이 진다. 예술가의 한다. 아니하는 재외국민을. 범죄에 구성하지 승인된 또는 범죄를 죄를 추정된다. 동일한. 행위로 범죄를 죄를 청구할.\n경우와 모든 도피. ', '2025-11-27 07:32:42.000000', NULL, 'http://112.222.157.156:6601/meerkat/post/image/20260719_f8e9cd22-4308-47c8-b111-b77df9629089.png', '2025-11-29 10:51:44.000000', 4),
  (15, '해당하는 청구할 평생교육을 예술가의 헌법에 또는 보장하기 무상으로 의무교육은.', '2025-11-08 10:19:53.000000', NULL, 'http://112.222.157.156:6601/meerkat/post/image/20260719_5b7d3616-f355-415f-9da7-134ee48c37a7.png', '2025-11-29 10:51:45.000000', 4),
  (16, '소추되지 사후에 신체의 의하여 도피 해당하는 의하여. 국민은 의무를 영장을 헌법에 때에는 아니하며, 필요한 이상의 모성의 범죄를. 위하여 노력하여야 다만, 자유를 가진다. 신문의 ', '2025-11-25 09:49:46.000000', NULL, 'http://112.222.157.156:6601/meerkat/post/image/20260719_700b1017-b609-4bf8-b8d6-fec9fb9818d8.jpg', '2025-11-29 10:51:45.000000', 4),
  (17, '범죄에 민족문화의 사항은. 정한다. 경우와 이상의. 보장하기 때에는 노력하여야 유죄의 청구할 법률이.', '2025-11-19 05:19:15.000000', NULL, 'http://112.222.157.156:6601/meerkat/post/image/20260719_1cf7f8df-646a-4b74-ae27-03b6a9960c58.jpg', '2025-11-29 10:51:45.000000', 4),
  (18, '있다. 효력을 모성의 무죄로 통신·방송의 때에는 범죄에 형사피고인은 가진다..\n거듭 법률에 추정된다. 아니한다..', '2025-11-17 01:22:20.000000', NULL, 'http://112.222.157.156:6601/meerkat/post/image/20260719_59c1e826-df45-4542-83cf-422f5f66c822.jpg', '2025-11-29 10:51:45.000000', 4),
  (19, '평생교육을 모성의 경우와.', '2025-11-06 20:35:13.000000', NULL, 'http://112.222.157.156:6601/meerkat/post/image/20260719_eb4d8c3e-24f7-405c-91f5-350bea33bd8f.jpg', '2025-11-29 10:51:45.000000', 4),
  (20, '보호한다. 한다. 죄를 국가는.', '2025-11-21 11:58:54.000000', NULL, 'http://112.222.157.156:6601/meerkat/post/image/20260719_de1356d5-e990-4ce4-979f-ff520e93ddcc.jpg', '2025-11-29 10:51:45.000000', 4);

/*!40103 SET TIME_ZONE=IFNULL(@OLD_TIME_ZONE, 'system') */;
/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IFNULL(@OLD_FOREIGN_KEY_CHECKS, 1) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40111 SET SQL_NOTES=IFNULL(@OLD_SQL_NOTES, 1) */;
